"use client";
import { useState } from "react";
import { Checkbox } from "@/components/ui/checkbox";

export const OrderTest = () => {
  const [totalItems, setTotalItems] = useState(0);
  const [totalOrders, setTotalOrders] = useState(1);

  const header = [
    { key: "checkbox", content: <Checkbox className="border-[#09090B]" /> },
    { key: "number", content: `№` },
    { key: "customer", content: `Customer` },
    { key: "food", content: `Food` },
    { key: "date", content: `Date` },
    { key: "cost amount", content: `Total` },
    { key: "address", content: `Delivery Address` },
    { key: "status", content: `Delivery State` },
  ];

  const dummyData = [
    { key: "checkbox", content: <Checkbox className="border-[#09090B]" /> },
    { key: "number", content: `1` },
    { key: "customer", content: `Naraa` },
    { key: "food", content: `Pizza` },
    { key: "date", content: `2024/12/20` },
    { key: "cost amount", content: `$19.00` },
    {
      key: "address",
      content: `2024/12/СБД, 12-р хороо, СБД нэгдсэн эмнэлэг Sbd negdsen `,
    },
    { key: "status", content: `Pending` },
  ];

  return (
    <div className="m-6">
      <div
        aria-label="The Order container"
        className="flex flex-col bg-[#FFF] w-[1171px] border border-[#e5e4e6] rounded-md"
      >
        <div aria-label="Header" className="flex justify-between p-4">
          <div aria-label="Header info" className="flex flex-col ">
            <p className="text-xl text-[#09090B] font-semibold">Orders</p>
            <p className="text-xs text-[#71717B]">{totalItems}</p>
          </div>
          <div aria-label="Header action" className="flex gap-3">
            <div
              aria-label="Date picker"
              className="py-2 px-4 flex items-center gap-2 rounded-full border-2 border-[#E4E4E7]"
            >
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="14"
                height="14"
                viewBox="0 0 14 14"
                fill="none"
              >
                <path
                  d="M10.1338 0.5C10.1519 0.500244 10.1669 0.515033 10.167 0.533203V1.56641H12.2666C12.8741 1.56641 13.3662 2.05948 13.3662 2.66699V12.2666C13.3662 12.8741 12.8741 13.3662 12.2666 13.3662H1.59961C0.992279 13.366 0.5 12.874 0.5 12.2666V2.66699C0.5 2.05961 0.992273 1.56662 1.59961 1.56641H3.7002V0.533203C3.70027 0.514856 3.71504 0.5 3.7334 0.5C3.75173 0.500035 3.76653 0.514878 3.7666 0.533203V1.56641H10.0996V0.533203C10.0997 0.514881 10.1154 0.5 10.1338 0.5ZM0.566406 12.2666C0.566406 12.8371 1.02907 13.2996 1.59961 13.2998H12.2666C12.8373 13.2998 13.2998 12.8373 13.2998 12.2666V4.83301H0.566406V12.2666ZM2.66699 11.167C2.68522 11.1672 2.7002 11.1819 2.7002 11.2002C2.70009 11.2184 2.68516 11.2332 2.66699 11.2334C2.64868 11.2334 2.6339 11.2185 2.63379 11.2002C2.63379 11.1818 2.64861 11.167 2.66699 11.167ZM4.7998 11.167C4.81819 11.167 4.83301 11.1818 4.83301 11.2002C4.8329 11.2185 4.81812 11.2334 4.7998 11.2334C4.78158 11.2333 4.76671 11.2184 4.7666 11.2002C4.7666 11.1819 4.78151 11.1671 4.7998 11.167ZM6.93359 11.167C6.95185 11.1671 6.9668 11.1819 6.9668 11.2002C6.96669 11.2184 6.95179 11.2333 6.93359 11.2334C6.91528 11.2334 6.9005 11.2185 6.90039 11.2002C6.90039 11.1818 6.91521 11.167 6.93359 11.167ZM9.06641 11.167C9.08479 11.167 9.09961 11.1818 9.09961 11.2002C9.0995 11.2185 9.08472 11.2334 9.06641 11.2334C9.04821 11.2333 9.03331 11.2184 9.0332 11.2002C9.0332 11.1819 9.04815 11.1671 9.06641 11.167ZM2.66699 9.0332C2.68516 9.03338 2.70006 9.04823 2.7002 9.06641C2.7002 9.0847 2.68525 9.09943 2.66699 9.09961C2.64858 9.09961 2.63379 9.08481 2.63379 9.06641C2.63393 9.04812 2.64867 9.0332 2.66699 9.0332ZM4.7998 9.0332C4.81812 9.0332 4.83287 9.04812 4.83301 9.06641C4.83301 9.08481 4.81821 9.09961 4.7998 9.09961C4.78149 9.0995 4.7666 9.08475 4.7666 9.06641C4.76674 9.04818 4.78157 9.03331 4.7998 9.0332ZM6.93359 9.0332C6.95179 9.03334 6.96666 9.0482 6.9668 9.06641C6.9668 9.08472 6.95188 9.09947 6.93359 9.09961C6.91519 9.09961 6.90039 9.08481 6.90039 9.06641C6.90053 9.04812 6.91528 9.0332 6.93359 9.0332ZM9.06641 9.0332C9.08472 9.0332 9.09947 9.04812 9.09961 9.06641C9.09961 9.08481 9.08481 9.09961 9.06641 9.09961C9.04812 9.09947 9.0332 9.08472 9.0332 9.06641C9.03334 9.04821 9.04821 9.03334 9.06641 9.0332ZM11.2002 9.0332C11.2184 9.03331 11.2333 9.04821 11.2334 9.06641C11.2334 9.08472 11.2185 9.0995 11.2002 9.09961C11.1818 9.09961 11.167 9.08479 11.167 9.06641C11.1671 9.04815 11.1819 9.0332 11.2002 9.0332ZM6.93359 6.90039C6.95188 6.90053 6.9668 6.91527 6.9668 6.93359C6.96666 6.9518 6.9518 6.96666 6.93359 6.9668C6.91527 6.9668 6.90053 6.95188 6.90039 6.93359C6.90039 6.91519 6.91519 6.90039 6.93359 6.90039ZM9.06641 6.90039C9.08481 6.90039 9.09961 6.91519 9.09961 6.93359C9.09947 6.95188 9.08472 6.9668 9.06641 6.9668C9.0482 6.96666 9.03334 6.95179 9.0332 6.93359C9.0332 6.91528 9.04812 6.90053 9.06641 6.90039ZM11.2002 6.90039C11.2185 6.9005 11.2334 6.91528 11.2334 6.93359C11.2333 6.95179 11.2184 6.96669 11.2002 6.9668C11.1819 6.9668 11.1671 6.95185 11.167 6.93359C11.167 6.91521 11.1818 6.90039 11.2002 6.90039ZM1.59961 1.63379C1.0291 1.634 0.566406 2.09643 0.566406 2.66699V4.7666H13.2998V2.66699C13.2998 2.09627 12.8372 1.63379 12.2666 1.63379H10.167V2.66699C10.1668 2.68508 10.1519 2.69995 10.1338 2.7002C10.1155 2.7002 10.0998 2.68523 10.0996 2.66699V1.63379H3.7666V2.66699C3.76643 2.68523 3.75167 2.70016 3.7334 2.7002C3.7151 2.7002 3.70037 2.68525 3.7002 2.66699V1.63379H1.59961Z"
                  fill="#18181B"
                  stroke="#18181B"
                />
              </svg>
              <p className="text-sm text-[#09090B] font-normal">
                13 June 2023 - 14 July 2023
              </p>
            </div>
            <div
              aria-label="Delivery state changer"
              className="py-2 px-4 flex items-center bg-[#d1d1d1] rounded-full"
            >
              <p className="text-sm font-medium text-[#fafafa]">
                Change delivery state
              </p>
            </div>
          </div>
        </div>

        <div
          aria-label="Table-row and their details"
          className="grid grid-cols-8 grid-rows-12 bg-[#E4E4E7]"
        >
          {header.map((item) => (
            <div
              key={item.key}
              className="text-sm text-[#71717A] font-medium p-4 "
            >
              {item.content}
            </div>
          ))}

          {dummyData.map((item) => (
            <div key={item.key}>{item.content} </div>
          ))}
        </div>
      </div>
    </div>
  );
};
